app/Views/Buku/index.php

                            <?php else : ?>
                                <?php
                                    $db = \Config\Database::connect();
                                    $isPending = $db->table('peminjaman')->where('id_buku', $b['id_buku'])->where('id_user', session()->get('id_user'))->whereIn('status', ['pending', 'dipinjam'])->get()->getRow();
---
SELECT *
FROM `peminjaman`
WHERE `id_buku` = '12'
AND `id_user` = '4'
AND `status` IN ('pending','dipinjam')