app/Controllers/Buku.php

    public function index()
    {
        $keyword = $this->request->getGet('keyword');
        $kategori = $this->request->getGet('kategori');

        // Inisialisasi model
        $builder = $this->bukuModel;

        // Logika Pencarian: jika ada keyword, cari berdasarkan judul
        if ($keyword) {
            $builder = $builder->like('judul', $keyword);
        }

        // Logika Kategori: jika ada kategori, filter berdasarkan kategori
        if ($kategori) {
            $builder = $builder->where('kategori', $kategori);
        }

        $data = [
            'title' => 'Katalog Buku',
            // Ambil hasil akhir setelah filter search/kategori
            'buku'  => $builder->findAll(),
---
SELECT *
FROM `buku`