app/Controllers/Dashboard.php

    public function index()
    {
        $db = \Config\Database::connect();

        // 1. Hitung Total Koleksi (Gunakan total baris atau sum stok)
        // Jika ingin menghitung jumlah judul buku, gunakan countAllResults()
        $total_buku = $db->table('buku')->countAllResults();

        // 2. Hitung Buku yang sedang dipinjam
        $total_dipinjam = $db->table('peminjaman')
                            ->where('status', 'dipinjam')
                            ->countAllResults();

        // 3. Hitung Siswa Aktif
        $total_siswa = $db->table('users')
                          ->where('role', 'user')
                          ->where('status', 'aktif')
                          ->countAllResults();

        // 4. Ambil Peminjaman Aktif (Semua yang sedang dipinjam agar tabel tidak kosong)
        $aktivitas = $db->table('peminjaman')
            ->select('peminjaman.*, buku.judul, users.nama, users.kelas')
            ->join('buku', 'buku.id_buku = peminjaman.id_buku')
            ->join('users', 'users.id_user = peminjaman.id_user')
            ->where('peminjaman.status', 'dipinjam')
            ->orderBy('peminjaman.tanggal_pinjam', 'DESC') // Urutkan dari yang terbaru dipinjam
            ->get()->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `buku`
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
WHERE `status` = 'dipinjam'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'user'
AND `status` = 'aktif'
SELECT `peminjaman`.*, `buku`.`judul`, `users`.`nama`, `users`.`kelas`
FROM `peminjaman`
JOIN `buku` ON `buku`.`id_buku` = `peminjaman`.`id_buku`
JOIN `users` ON `users`.`id_user` = `peminjaman`.`id_user`
WHERE `peminjaman`.`status` = 'dipinjam'
ORDER BY `peminjaman`.`tanggal_pinjam` DESC