app/Controllers/Peminjaman.php

SELECT `peminjaman`.*, `users`.`nama`, `buku`.`judul`
FROM `peminjaman`
JOIN `users` ON `users`.`id_user` = `peminjaman`.`id_user`
JOIN `buku` ON `buku`.`id_buku` = `peminjaman`.`id_buku`
WHERE `peminjaman`.`id_user` = '4'
ORDER BY `peminjaman`.`id_pinjam` DESC
---
    public function index()
    {
        $role = session()->get('role');
        $id_user = session()->get('id_user');

        // Memperbaiki JOIN agar mengarah ke tabel 'users' sesuai database kamu
        $builder = $this->peminjamanModel
            ->select('peminjaman.*, users.nama, buku.judul')
            ->join('users', 'users.id_user = peminjaman.id_user')
            ->join('buku', 'buku.id_buku = peminjaman.id_buku');

        // Filter jika yang login bukan admin
        if ($role != 'admin') {
            $builder->where('peminjaman.id_user', $id_user);
        }

        $data = [
            'title'      => 'Daftar Transaksi Peminjaman',
            'peminjaman' => $builder->orderBy('peminjaman.id_pinjam', 'DESC')->findAll()
        ];

SELECT *
FROM `buku`
WHERE `buku`.`id_buku` = '13'
INSERT INTO `peminjaman` (`id_user`, `id_buku`, `tanggal_pinjam`, `durasi`, `status`) VALUES ('4', '13', '2026-04-28 12:04:29', '1', 'dipinjam')
UPDATE `buku` SET `stok` = 14
WHERE `buku`.`id_buku` IN ('13')
---
    public function simpan()
    {
        $id_buku = $this->request->getPost('id_buku');
        $buku = $this->bukuModel->find($id_buku);

        if ($buku && $buku['stok'] > 0) {
            $this->peminjamanModel->save([
                'id_user'        => session()->get('id_user'),
                'id_buku'        => $id_buku,
                'tanggal_pinjam' => date('Y-m-d H:i:s'),
                'durasi'         => $this->request->getPost('durasi_pinjam'),
                'status'         => 'dipinjam'
            ]);

            $this->bukuModel->update($id_buku, ['stok' => $buku['stok'] - 1]);